# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
user_data = {
    "MarksA" : np.random.randint(1, 100, 5),
    "MarksB" : np.random.randint(50, 100, 5),
    "MarksC" : np.random.randint(1, 100, 5)
}
user_data

{'MarksA': array([48, 85, 86, 34, 69]),
 'MarksB': array([68, 82, 56, 62, 59]),
 'MarksC': array([53, 99, 45, 58, 14])}

In [5]:
df = pd.DataFrame(user_data, dtype='float32')
print(df)

   MarksA  MarksB  MarksC
0    48.0    68.0    53.0
1    85.0    82.0    99.0
2    86.0    56.0    45.0
3    34.0    62.0    58.0
4    69.0    59.0    14.0

In [4]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [6]:
df.to_csv("Marks.csv")

In [9]:
my_data = pd.read_csv("Marks.csv")
my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0    48.0    68.0    53.0
1    85.0    82.0    99.0
2    86.0    56.0    45.0
3    34.0    62.0    58.0
4    69.0    59.0    14.0

In [10]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   64.400000  65.400000  53.800000
std    22.941229  10.285913  30.507376
min    34.000000  56.000000  14.000000
25%    48.000000  59.000000  45.000000
50%    69.000000  62.000000  53.000000
75%    85.000000  68.000000  58.000000
max    86.000000  82.000000  99.000000

In [11]:
my_data.tail(3)

   MarksA  MarksB  MarksC
2    86.0    56.0    45.0
3    34.0    62.0    58.0
4    69.0    59.0    14.0

In [12]:
df.iloc[3] #integer location

MarksA    34.0
MarksB    62.0
MarksC    58.0
Name: 3, dtype: float32

In [13]:
df.iloc[3, 1]

62.0

In [18]:
df.iloc[:, 1]

0    68.0
1    82.0
2    56.0
3    62.0
4    59.0
Name: MarksB, dtype: float32

In [24]:
index = df.columns.get_loc('MarksB')
df.iloc[index:, 2]

1    99.0
2    45.0
3    58.0
4    14.0
Name: MarksC, dtype: float32

In [26]:
 my_data.sort_values(by=["MarksC","MarksA"], ascending=False)

   MarksA  MarksB  MarksC
1    85.0    82.0    99.0
3    34.0    62.0    58.0
0    48.0    68.0    53.0
2    86.0    56.0    45.0
4    69.0    59.0    14.0

In [27]:
data = my_data.values
print(data)
print(data.shape)
print(type(data))

[[48. 68. 53.]
 [85. 82. 99.]
 [86. 56. 45.]
 [34. 62. 58.]
 [69. 59. 14.]]
(5, 3)
<class 'numpy.ndarray'>

In [31]:
new_df = pd.DataFrame(data)
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [32]:
pcm = new_df.to_csv("PCM.csv", index=False)